---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings)
source: html/eb5c3132-cfa6-d815-2d0b-1bb4ea1aa7fc.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.#ctor Method

Constructs a new copy of the input AnalysisDisplayColorSettings object.

## Syntax (C#)
```csharp
public AnalysisDisplayColorSettings(
	AnalysisDisplayColorSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null